app/views/tags/show.html.erb

<ul>
  <% @tag.profils.each do |profil| %>
---
SELECT "profils".* FROM "profils" INNER JOIN "taggings" ON "profils"."id" = "taggings"."profil_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 10]]