app/controllers/authors_controller.rb

  def show

    @authors = Author.find(params[:id]) #reccupere l'id de l url
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("created_at", "crypted_password", "email", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "username" = ?, "email" = ?, "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "authors"."id" = 2