app/controllers/profils_controller.rb

SELECT "profils".* FROM "profils"
---
def index
  @profils = Profil.all

SELECT "profils".* FROM "profils" WHERE "profils"."id" = ? ORDER BY "profils"."id" ASC LIMIT 1  [["id", 8]]
---
def show
  @profils = Profil.find(params[:id]) #reccupere l'id de l url

SELECT "profils".* FROM "profils" WHERE "profils"."id" = ? LIMIT 1  [["id", "8"]]
---
def edit
  @profils = Profil.find(params[:id]) #reccupere l'id de l url

SELECT "profils".* FROM "profils" WHERE "profils"."id" = ? LIMIT 1  [["id", "13"]]
UPDATE "profils" SET "body" = ?, "updated_at" = ? WHERE "profils"."id" = 13  [["body", "sdlmskdlmkdlmsdklmsdkmqslds\r\nsdss:!;d"], ["updated_at", Mon, 16 Sep 2013 15:27:22 UTC +00:00]]
---
def update
  @profils = Profil.find(params[:id])
  @profils.update(profil_params)

INSERT INTO "profils" ("body", "created_at", "nom", "updated_at") VALUES (?, ?, ?, ?)  [["body", "bonjour"], ["created_at", Mon, 16 Sep 2013 11:28:50 UTC +00:00], ["nom", "sabrina "], ["updated_at", Mon, 16 Sep 2013 11:28:50 UTC +00:00]]
---
def create              # le submit va chercher la methode create
  @profils = Profil.new(profil_params)
  @profils.nom = params[:profil][:nom]  # on reccupere le nom du form
  @profils.body = params[:profil][:body] # on reccupere le body du form

  @profils.save   #on sauvegarde

DELETE FROM "profils" WHERE "profils"."id" = ?  [["id", 2]]
SELECT "profils".* FROM "profils" WHERE "profils"."id" = ? LIMIT 1  [["id", "3"]]
---
def destroy

@profils = Profil.find(params[:id]).destroy  #reccupere l'id de l url